package global;

public interface PasswordConfig {
    /**
     * 用户密码格式--强
     * 密码必须包含大写、小写、数字和特殊字符，且长度是8-32位
     * */
    String PWD_S = "^(?=.*[a-z])(?=.*[A-Z])(?=.*\\d)(?=.*[!@#$%^&*()=_+;':,.?]).{8,32}$";
    String PWD_S_TEXT = "密码必须包含字母大写、小写、数字和特殊字符，且长度是8-32位";

    /**
     * 用户密码格式--中
     * 密码必须包含大写、小写和数字，且长度是8-32位
     * */
    String PWD_A = "^(?=.*[a-z])(?=.*[A-Z])(?=.*\\d).{8,32}$";
    String PWD_A_TEXT = "密码必须包含字母大写、小写和数字，且长度是8-32位";


    /**
     * 用户密码格式--弱
     * 密码必须包含字母和数字，且长度是8-32位
     * */
    String PWD_B = "^(?=.*[A-Za-z])(?=.*\\d).{8,32}$";
    String PWD_B_TEXT = "密码必须包含字母和数字，且长度是8-32位";

    /**
     * 用户密码格式--超弱
     * 密码必须包含数字，且长度是8-32位
     * */
    String PWD_C = "^(?=.*\\d).{8,32}$";
    String PWD_C_TEXT = "密码必须包含数字，且长度是8-32位";


    /**
     * 手机号码格式
     * 11位手机号码
     * */
    String PHONE_NUM = "^1[3-9]\\d{9}$";
    String PHONE_TEXT = "手机号码应该为11位";

    /**
     * 工号格式
     * */
    String WORK_ID_NUM = "^[0-9]{10}$";
    String WORK_ID_TEXT = "工号应该为10位";

}
